32 116
104 101
32 97
111 117
32 115
32 109
105 110
32 119
114 101
104 97
110 100
256 257
32 98
105 115
111 114
32 102
101 114
108 108
105 116
111 110
32 100
32 99
101 115
101 110
32 110
32 108
32 121
256 104
97 114
32 104
32 111
256 111
282 259
32 112
265 116
32 73
32 257
118 101
111 116
115 116
258 266
111 119
262 103
97 110
286 102
111 109
32 103
97 116
268 101
115 101
261 121
32 262
99 101
32 265
108 101
97 121
108 100
105 114
101 116
101 100
117 116
261 101
105 109
274 104
39 115
280 294
99 104
256 290
32 269
103 104
65 266
271 270
107 101
32 117
259 114
263 101
111 111
105 273
32 101
257 114
263 319
279 116
32 274
288 114
97 100
114 105
283 259
260 116
39 100
32 107
301 101
285 269
325 116
69 78
270 100
105 100
97 115
84 257
32 264
309 293
73 78
108 121
114 97
281 105
285 318
117 114
283 269
97 108
73 79
260 111
258 115
276 101
32 275
111 264
114 111
65 82
104 105
259 312
332 100
99 107
97 262
118 272
278 116
283 121
260 265
278 115
101 97
276 111
263 333
97 109
280 111
268 316
117 115
97 266
85 83
105 102
260 101
103 101
84 104
258 273
260 117
97 328
84 111
292 114
114 117
105 275
116 104
258 110
116 272
284 100
281 111
265 110
101 273
101 284
260 112
267 101
32 330
271 97
380 273
268 121
85 67
105 108
258 264
356 71
32 67
280 101
114 301
104 111
345 110
65 78
32 82
84 290
32 118
69 82
97 295
79 82
99 116
259 115
263 290
105 348
260 104
117 108
32 39
69 84
299 116
69 83
329 112
305 108
113 117
66 316
284 116
302 374
114 297
303 104
262 101
281 350
372 322
110 116
117 295
39 273
275 101
289 114
277 301
258 116
261 299
32 77
87 290
263 257
32 69
75 419
258 109
101 266
105 99
277 275
98 310
114 121
275 103
105 101
105 293
271 422
268 108
118 279
32 71
70 270
260 257
101 109
302 111
97 264
261 369
267 109
259 116
73 67
263 352
97 117
294 335
294 104
72 101
260 313
111 108
280 297
32 76
32 290
32 391
111 295
76 79
262 100
267 264
424 297
263 373
277 299
272 115
73 390
101 112
443 102
371 68
303 335
102 101
111 266
264 115
303 101
260 311
292 264
406 293
267 313
260 119
268 114
112 112
32 270
97 273
45 45
32 83
256 407
345 298
267 110
329 115
32 79
267 121
32 66
258 114
111 100
77 121
281 314
329 110
105 103
263 270
117 264
262 107
32 72
270 116
104 121
385 101
32 86
102 369
65 115
261 311
101 108
277 346
32 444
332 107
87 257
269 104
76 73
331 273
75 69
118 278
32 106
368 101
497 104
313 295
89 259
261 397
264 303
103 376
97 107
261 454
259 266
110 103
302 358
331 264
285 111
99 105
392 101
359 328
117 101
382 107
436 373
84 364
274 121
289 370
261 340
260 97
32 80
117 109
289 108
271 511
82 79
65 85
309 100
276 351
112 101
318 101
442 275
105 308
287 111
79 78
279 308
32 87
119 405
269 116
367 449
297 110
32 279
111 305
109 299
117 110
102 437
73 83
110 308
410 580
32 114
289 111
100 101
337 310
32 486
105 111
263 452
112 116
487 72
271 341
79 76
258 568
68 85
627 559
285 297
69 76
32 65
292 446
256 400
105 375
309 266
282 314
394 259
67 65
377 121
623 510
349 582
87 319
539 110
299 308
260 346
263 423
87 452
73 102
463 110
105 278
261 284
105 264
285 275
261 450
270 110
265 114
300 102
262 308
356 67
97 375
73 110
32 89
276 269
260 275
258 108
39 116
87 101
119 110
292 97
117 322
70 564
111 121
292 284
256 596
101 99
396 322
65 66
110 381
521 490
76 65
79 102
476 374
274 335
258 98
267 305
87 545
85 69
78 111
302 474
271 111
276 311
334 284
426 640
291 73
269 101
334 120
32 370
394 269
359 512
441 84
256 408
101 314
283 542
83 111
281 554
416 72
263 350
463 264
334 121
259 108
116 335
97 393
97 103
101 279
624 467
256 397
71 500
717 416
718 700
719 429
101 102
272 118
340 121
448 110
298 115
276 278
110 294
97 293
361 305
302 618
32 341
72 297
82 89
97 305
119 311
81 687
736 349
659 641
281 382
116 269
531 70
534 116
261 499
555 264
653 330
261 670
76 425
260 108
263 284
271 108
361 110
585 101
109 337
78 297
309 295
271 409
256 119
32 84
304 116
489 348
349 733
73 115
102 102
98 272
478 535
76 69
293 100
259 325
268 264
99 99
421 377
297 272
547 738
66 101
97 112
105 325
302 567
413 313
32 75
277 259
261 279
274 116
87 423
101 101
426 346
421 119
430 272
270 448
117 328
105 122
111 312
431 75
289 446
303 401
356 507
351 101
264 101
115 115
79 114
277 524
403 121
112 310
669 477
258 100
458 109
505 727
89 330
73 116
343 389
633 101
304 279
409 115
280 546
68 87
814 510
277 108
289 264
520 702
457 311
44 525
276 491
104 298
386 470
85 77
80 439
286 668
77 349
289 310
352 115
84 72
76 416
259 305
289 272
32 68
67 346
353 264
65 121
117 273
276 456
391 101
263 114
256 114
97 119
263 311
286 711
292 340
317 299
108 105
555 110
264 100
280 270
100 603
260 99
289 514
260 710
591 77
856 69
857 79
827 349
859 507
304 284
540 312
97 308
376 116
280 435
118 298
420 108
489 305
103 272
304 548
268 491
553 714
112 272
353 110
760 272
277 372
261 111
492 264
825 82
879 706
880 364
32 639
97 470
79 77
367 340
84 441
32 358
274 101
66 121
116 111
116 257
84 407
32 328
108 278
97 98
276 606
32 70
469 116
258 522
306 509
534 109
354 109
263 104
496 350
72 65
71 82
283 388
417 116
431 364
909 747
910 390
83 675
912 513
739 293
67 911
304 298
432 401
108 111
464 852
329 453
115 119
573 308
78 270
514 115
709 278
108 381
304 103
261 490
108 389
310 100
66 65
114 299
286 312
261 97
32 318
464 815
356 65
274 790
938 279
461 284
334 377
112 115
281 472
359 293
876 312
76 314
263 840
109 101
258 735
354 112
83 257
694 73
616 270
715 115
263 301
261 435
99 346
258 102
102 270
119 634
343 311
266 272
382 308
276 473
259 100
107 115
303 322
458 278
32 400
32 74
469 115
284 960
460 121
297 115
277 724
289 101
281 101
265 273
84 269
269 275
662 792
354 295
342 348
269 115
117 375
309 114
285 832
612 677
988 630
989 680
277 330
272 99
105 299
32 337
359 101
82 425
260 314
99 257
303 404
270 115
119 408
602 972
74 85
1003 557
1004 439
766 600
1006 886
78 311
782 310
262 116
302 456
276 875
759 404
114 440
259 348
457 658
77 73
256 472
72 269
321 822
68 89
86 625
349 67
1023 69
680 1021
105 315
893 508
66 82
84 65
263 274
354 115
105 433
87 408
99 278
111 115
71 111
786 115
656 100
260 310
102 116
275 116
105 272
264 116
256 341
83 487
1045 795
332 108
610 101
283 608
302 341
626 295
281 1009
78 294
451 115
569 278
268 378
292 613
285 330
405 275
102 350
258 770
437 116
305 100
690 273
108 305
413 308
79 110
334 266
117 100
284 107
101 119
288 572
473 312
345 501
283 298
343 333
270 107
289 341
363 107
289 361
458 112
394 121
83 84
831 364
97 310
262 115
289 772
289 316
272 116
757 111
468 1038
291 86
360 509
277 265
302 117
367 284
271 564
262 381
289 963
334 1065
99 108
80 370
341 315
576 433
372 310
920 111
83 313
97 417
396 98
352 275
256 333
260 109
105 310
114 311
316 121
101 432
780 453
277 111
268 660
707 115
285 388
268 351
502 548
692 402
256 358
276 264
82 73
464 557
1128 90
1129 677
1130 439
1131 72
105 388
111 802
277 373
109 279
72 728
1018 579
271 501
98 389
121 363
116 121
421 315
283 450
281 723
270 305
662 1077
264 110
271 408
285 776
327 402
103 314
116 119
575 595
279 471
72 761
292 108
83 116
784 322
285 346
392 481
1121 1140
314 104
293 264
77 429
785 111
731 348
67 76
276 789
316 104
342 325
32 462
264 114
102 544
268 299
547 73
71 69
87 371
1178 87
1179 487
1180 75
976 1134
277 656
269 404
268 358
97 322
261 501
372 112
85 84
105 120
277 257
543 761
420 939
100 115
103 315
78 729
353 121
256 264
543 1155
905 77
436 297
101 315
277 407
469 102
268 341
281 843
635 115
426 1091
80 85
1209 76
1210 439
73 425
263 545
935 112
368 308
586 351
302 108
98 101
277 868
261 787
69 89
268 535
83 978
561 672
280 456
71 374
722 440
433 262
77 364
65 273
327 116
98 116
521 298
89 314
334 639
303 278
1028 1189
1237 390
276 259
416 465
1240 1200
70 422
289 829
313 100
359 348
105 314
261 604
66 1241
441 83
533 625
1250 419
1251 66
1252 591
1253 559
84 996
1255 364
280 303
87 333
921 272
283 114
108 116
68 111
697 1141
263 111
118 499
274 115
646 305
828 734
277 546
99 310
256 812
461 371
284 121
80 429
84 612
270 121
370 328
118 121
108 102
289 1059
631 110
292 405
112 608
367 118
561 454
284 471
268 278
854 337
268 672
271 838
67 108
841 472
309 522
78 69
1272 71
1295 371
1296 439
261 269
334 264
343 515
260 658
101 551
589 863
279 115
281 430
281 389
1017 76
65 830
345 333
115 389
109 98
111 375
317 314
958 404
329 962
274 401
277 483
342 1310
575 312
378 121
99 337
260 788
431 68
906 69
425 1177
1325 500
72 431
1157 112
79 361
1064 297
903 301
483 613
67 85
371 937
576 388
607 481
313 116
443 560
709 101
684 486
308 474
285 683
281 381
100 311
271 284
331 508
380 948
75 1308
1348 1334
289 303
275 115
403 1259
396 110
105 494
271 1047
271 363
361 617
352 541
97 313
413 273
934 351
277 104
259 453
402 121
268 388
497 101
85 112
730 609
573 1104
85 110
1050 721
277 1228
779 298
441 638
1374 76
1375 390
106 1116
261 1055
343 341
111 293
318 278
307 890
65 110
105 312
343 264
105 118
72 449
955 299
464 572
285 588
468 278
108 298
780 110
991 116
458 1174
256 751
1039 508
383 295
363 116
1357 1173
834 789
68 706
1402 1249
256 1079
1222 121
304 108
286 377
112 335
274 270
76 350
940 1335
617 315
316 101
268 117
302 114
263 908
109 788
393 918
473 293
413 1062
459 116
105 601
32 105
73 65
304 100
589 311
584 293
269 315
867 1332
638 1307
1430 500
299 115
367 315
105 357
307 295
354 116
331 108
527 107
101 264
260 571
276 358
340 101
301 314
71 535
307 1412
260 272
520 350
271 435
423 312
1356 305
268 111
428 111
333 376
1281 1418
1327 84
1455 349
1456 83
334 477
1149 297
83 104
573 293
1367 275
403 490
329 305
804 118
365 1164
70 1127
1467 371
1102 1265
1457 364
309 115
277 361
361 121
44 39
1231 1048
595 432
101 363
1175 556
931 80
1479 1275
1480 1029
615 511
354 477
1117 471
261 999
263 440
109 112
392 266
259 322
67 884
1490 795
1239 1232
366 115
112 279
512 432
457 980
261 992
592 84
1498 625
1499 89
1500 67
1501 390
428 1337
368 357
69 477
46 39
263 556
77 369
359 278
842 1170
282 812
65 264
394 1244
354 1110
371 1024
87 373
769 449
901 115
109 115
111 102
105 270
289 506
32 445
299 121
276 299
1408 100
114 644
1126 385
1168 1515
1365 1098
663 99
279 272
77 371
260 337
100 100
302 105
343 358
380 1261
100 272
78 431
66 349
1541 1022
1542 364
1291 606
607 768
260 279
257 100
98 121
65 116
289 422
805 389
65 108
722 298
575 357
906 824
1555 364
80 591
1557 83
1558 1274
1559 79
898 337
457 965
277 358
365 312
281 311
309 572
343 932
303 270
105 97
520 409
289 583
413 264
263 501
410 313
107 279
260 382
284 115
304 97
461 1400
1165 1333
1580 582
568 295
1257 541
105 328
314 272
902 481
367 112
1437 957
392 99
276 483
359 560
428 1453
779 515
831 641
482 1194
307 116
302 314
117 453
585 385
